# ProfileLoopEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweepFailures..::..ProfileLoopEmpty Property
BuiltInFailures..::..SweepFailures Class See Also
---
Profile sketch is empty!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProfileLoopEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileLoopEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProfileLoopEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SweepFailures Class
Autodesk.Revit.DB Namespace